update: refine readme file
